Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
                    // Set alarm behavior: G38.2 and G38.4 alarm on failure
                    ev->data.probe.alarm_on_fail = (subcode == 2 || subcode == 4);
                    
                    // Parse axis parameters and feedrate
                    const float unit_scale = unitsInches ? 25.4f : 1.0f;
                    
                    // Array-based axis parameter parsing
                    float axis_values[NUM_AXIS];
                    for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                        char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                        axis_values[axis] = pAxis ? parse_float_after(pAxis) : NAN;
                    }
                    
                    // Store target coordinates (NAN = no change for that axis)
                    ev->data.probe.x = !isnan(axis_values[AXIS_X]) ? axis_values[AXIS_X] * unit_scale : NAN;
                    ev->data.probe.y = !isnan(axis_values[AXIS_Y]) ? axis_values[AXIS_Y] * unit_scale : NAN;
                    ev->data.probe.z = !isnan(axis_values[AXIS_Z]) ? axis_values[AXIS_Z] * unit_scale : NAN;
                    ev->data.probe.a = !isnan(axis_values[AXIS_A]) ? axis_values[AXIS_A] * unit_scale : NAN;
                    
                    // Parse feedrate (required for probe moves)
                    char* pF = find_char((char*)cmd, 'F');
                    ev->data.probe.feedrate = pF ? (parse_float_after(pF) * unit_scale) : 0.0f;
                    
                    DEBUG_PRINT_GCODE("[PARSE] Probe G38.%d: toward=%d alarm=%d Z=%.2f F=%.1f\r\n",
                                     subcode, ev->data.probe.probe_toward, 
                                     ev->data.probe.alarm_on_fail,
                                     ev->data.probe.z, ev->data.probe.feedrate);
                    
                    return true;
                } else {
                    DEBUG_PRINT_GCODE("[PARSE] Invalid G38 subcode: %d\r\n", subcode);
                    return false;
                }
            }
            DEBUG_PRINT_GCODE("[PARSE] G38 missing subcode\r\n");
            return false;
        }

        // G43 / G43.1 - Activate Tool Length Offset
        // G43      : activate stored TLO (from settings; optional H-word ignored — single tool supported)
        // G43.1 Z# : dynamic inline TLO from Z parameter
        if (gnum == 43) {
            char* pDot = find_char((char*)cmd, '.');
            int subcode = pDot ? (int)strtol(pDot + 1, NULL, 10) : 0;
            ev->type = GCODE_EVENT_TLO_SET;
            if (subcode == 1) {
                // G43.1 — inline dynamic value from Z parameter
                char* pZ = find_char((char*)cmd, 'Z');
                const float unit_scale = unitsInches ? 25.4f : 1.0f;
                ev->data.tlo.value   = pZ ? (parse_float_after(pZ) * unit_scale) : 0.0f;
                ev->data.tlo.dynamic = true;
            } else {
                // G43 — use persisted tool length offset from settings
                ev->data.tlo.value   = SETTINGS_GetToolLengthOffset();
                ev->data.tlo.dynamic = false;
            }
            DEBUG_PRINT_GCODE("[PARSE] G43.%d TLO=%.3f dynamic=%d\r\n",
                              subcode, (double)ev->data.tlo.value, (int)ev->data.tlo.dynamic);
            return true;
        }

        // G49 - Cancel Tool Length Offset
        if (gnum == 49) {
            ev->type = GCODE_EVENT_TLO_CANCEL;
            DEBUG_PRINT_GCODE("[PARSE] G49 TLO cancel\r\n");
            return true;
        }

        // G80 - Cancel active canned cycle
        if (gnum == 80) {
            ev->type = GCODE_EVENT_CANNED_CANCEL;
            DEBUG_PRINT_GCODE("[PARSE] G80 canned cancel\r\n");
            return true;
        }

        // G81 - Simple drill cycle: rapid to X/Y, rapid to R, feed to Z, rapid out
        // G83 - Peck drill cycle: same approach but depth in Q increments with retract between
        if (gnum == 81 || gnum == 83) {
            const float unit_scale = unitsInches ? 25.4f : 1.0f;

            char* pX = find_char((char*)cmd, 'X');
            char* pY = find_char((char*)cmd, 'Y');
            char* pZ = find_char((char*)cmd, 'Z');
            char* pR = find_char((char*)cmd, 'R');
            char* pQ = find_char((char*)cmd, 'Q');
            char* pF = find_char((char*)cmd, 'F');
            char* pL = find_char((char*)cmd, 'L');

            // Z and R are required; reject silently if missing
            if (!pZ || !pR) {
                DEBUG_PRINT_GCODE("[PARSE] G8%d missing Z or R — ignored\r\n", gnum == 81 ? 1 : 3);
                return false;
            }

            ev->type = (gnum == 81) ? GCODE_EVENT_CANNED_DRILL : GCODE_EVENT_CANNED_PECK;

            ev->data.cannedDrill.x        = pX ? (parse_float_after(pX) * unit_scale) : NAN;
            ev->data.cannedDrill.y        = pY ? (parse_float_after(pY) * unit_scale) : NAN;
            ev->data.cannedDrill.z        = parse_float_after(pZ) * unit_scale;
            ev->data.cannedDrill.r        = parse_float_after(pR) * unit_scale;
            ev->data.cannedDrill.q        = pQ ? (parse_float_after(pQ) * unit_scale) : 0.0f;
            ev->data.cannedDrill.feedrate = pF ? (parse_float_after(pF) * unit_scale) : 0.0f;
            // L0 or L absent → treat as L1 (one hole), GRBL convention
            uint32_t l_raw = pL ? (uint32_t)strtol(pL + 1, NULL, 10) : 1u;
            ev->data.cannedDrill.l        = (l_raw == 0u) ? 1u : l_raw;
            ev->data.cannedDrill.g98      = s_canned_g98;

            DEBUG_PRINT_GCODE("[PARSE] G%d X=%.2f Y=%.2f Z=%.2f R=%.2f Q=%.2f F=%.1f L=%lu G%s\r\n",
                gnum,
                (double)ev->data.cannedDrill.x, (double)ev->data.cannedDrill.y,
                (double)ev->data.cannedDrill.z, (double)ev->data.cannedDrill.r,
                (double)ev->data.cannedDrill.q, (double)ev->data.cannedDrill.feedrate,
                (unsigned long)ev->data.cannedDrill.l,
                s_canned_g98 ? "98" : "99");
            return true;
        }

        // G33 - Spindle-synchronised motion (rigid tapping precursor)
        // Blocked until spindle encoder feedback is available (Phase 5).
        if (gnum == 33) {
            UART_Printf("error:2\r\n");  // unsupported command
            DEBUG_PRINT_GCODE("[PARSE] G33 unsupported (no spindle encoder)\r\n");
            ev->type = GCODE_EVENT_NONE;
            return true;  // consume to avoid infinite replay
        }

        if (gnum == 0 || gnum == 1) {
            ev->type = GCODE_EVENT_LINEAR_MOVE;
            ev->data.linearMove.isRapid = (gnum == 0);  // G0 = rapid, G1 = feed
            DEBUG_PRINT_GCODE("[PARSE] Linear move (G%d)%s\r\n", gnum, (gnum == 0) ? " RAPID" : "");
        } else if (gnum == 2) {
            ev->type = GCODE_EVENT_ARC_MOVE;
            ev->data.arcMove.clockwise = true;
            DEBUG_PRINT_GCODE("[PARSE] Arc CW (G2)\r\n");
        } else if (gnum == 3) {
            ev->type = GCODE_EVENT_ARC_MOVE;
            ev->data.arcMove.clockwise = false;
            DEBUG_PRINT_GCODE("[PARSE] Arc CCW (G3)\r\n");
        } else if (gnum == 4) {
            ev->type = GCODE_EVENT_DWELL;
            char* pP = strstr((char*)cmd, "P");
            ev->data.dwell.seconds = pP ? parse_float_after(pP) : 0.0f;
            return true;
        } else {
            return false;
        }

