Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
        // Array-based axis parameter parsing with loop
        char* pAxis[NUM_AXIS];
        float axis_values[NUM_AXIS];
        
        for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
            pAxis[axis] = find_char((char*)cmd, axis_letters[axis]);
            axis_values[axis] = pAxis[axis] ? parse_float_after(pAxis[axis]) : NAN;
        }
        
        char* pF = find_char((char*)cmd, 'F');
        const float unit_scale = unitsInches ? 25.4f : 1.0f;

        if (ev->type == GCODE_EVENT_LINEAR_MOVE) {
            float f = pF ? parse_float_after(pF) : 0.0f;
            // Event structure still uses hardcoded members (future refactoring opportunity)
            ev->data.linearMove.x = !isnan(axis_values[AXIS_X]) ? axis_values[AXIS_X] * unit_scale : NAN;
            ev->data.linearMove.y = !isnan(axis_values[AXIS_Y]) ? axis_values[AXIS_Y] * unit_scale : NAN;
            ev->data.linearMove.z = !isnan(axis_values[AXIS_Z]) ? axis_values[AXIS_Z] * unit_scale : NAN;
            ev->data.linearMove.a = !isnan(axis_values[AXIS_A]) ? axis_values[AXIS_A] * unit_scale : NAN;
            ev->data.linearMove.feedrate = (f > 0.0f) ? (f * unit_scale) : 0.0f;
            // For G0, isRapid was already set above; feedrate=0 means "use max_rate in motion.c"
            return true;
        } else if (ev->type == GCODE_EVENT_ARC_MOVE) {
            char* pI = find_char((char*)cmd, 'I');
            char* pJ = find_char((char*)cmd, 'J');
            float i = pI ? parse_float_after(pI) : 0.0f;
            float j = pJ ? parse_float_after(pJ) : 0.0f;
            float f = pF ? parse_float_after(pF) : 0.0f;
            // Event structure still uses hardcoded members (future refactoring opportunity)
            ev->data.arcMove.x = !isnan(axis_values[AXIS_X]) ? axis_values[AXIS_X] * unit_scale : NAN;
            ev->data.arcMove.y = !isnan(axis_values[AXIS_Y]) ? axis_values[AXIS_Y] * unit_scale : NAN;
            ev->data.arcMove.z = !isnan(axis_values[AXIS_Z]) ? axis_values[AXIS_Z] * unit_scale : NAN;
            ev->data.arcMove.a = !isnan(axis_values[AXIS_A]) ? axis_values[AXIS_A] * unit_scale : NAN;
            ev->data.arcMove.centerX = i * unit_scale;
            ev->data.arcMove.centerY = j * unit_scale;
            ev->data.arcMove.feedrate = (f > 0.0f) ? (f * unit_scale) : 0.0f;
            DEBUG_PRINT_GCODE("[PARSE] Arc params: X=%.2f Y=%.2f I=%.2f J=%.2f F=%.1f\r\n",
                             ev->data.arcMove.x, ev->data.arcMove.y, 
                             ev->data.arcMove.centerX, ev->data.arcMove.centerY, 
                             ev->data.arcMove.feedrate);
            return true;
        }
    }

    if (cmd[0] == 'F') {
        ev->type = GCODE_EVENT_SET_FEEDRATE;
        float f = (float)strtof(&cmd[1], NULL);
        ev->data.setFeedrate.feedrate = unitsInches ? (f * 25.4f) : f;
        return true;
    }
    if (cmd[0] == 'S') {
        ev->type = GCODE_EVENT_SET_SPINDLE_SPEED;
        ev->data.setSpindleSpeed.rpm = (uint32_t)strtoul(&cmd[1], NULL, 10);
        return true;
    }
    if (cmd[0] == 'T') {
        ev->type = GCODE_EVENT_SET_TOOL;
        ev->data.setTool.toolNumber = (uint32_t)strtoul(&cmd[1], NULL, 10);
        return true;
    }

    if (cmd[0] == 'M') {
        char* pend = NULL;
        int mnum = (int)strtol(&cmd[1], &pend, 10);
        if (mnum == 0) { ev->type = GCODE_EVENT_PROGRAM_END; return true; }  // M0 - Program stop
        if (mnum == 2) { ev->type = GCODE_EVENT_PROGRAM_END; return true; }  // M2 - Program end
        if (mnum == 3) {
            ev->type = GCODE_EVENT_SPINDLE_ON;
            char* pS = find_char((char*)cmd, 'S');
            ev->data.spindle.rpm = pS ? (uint32_t)strtoul(pS + 1, NULL, 10) : 1000;
            return true;
        }
        if (mnum == 5) { ev->type = GCODE_EVENT_SPINDLE_OFF; return true; }
        if (mnum == 7) { ev->type = GCODE_EVENT_COOLANT_ON; return true; }
        if (mnum == 9) { ev->type = GCODE_EVENT_COOLANT_OFF; return true; }
        if (mnum == 30) { ev->type = GCODE_EVENT_PROGRAM_END; return true; } // M30 - Program end and reset
    }
    
    // System commands ($H, $X, etc.)
    if (cmd[0] == '$') {
        if (cmd[1] == 'H' && (cmd[2] == '\0' || cmd[2] == '\n' || cmd[2] == '\r')) {
            // $H - Home all axes command
            ev->type = GCODE_EVENT_HOMING;
            ev->data.homing.axes_mask = SETTINGS_GetCurrent()->homing_enable; // axes bitmask from $22 (0x07=XYZ, 0x0F=XYZA)
            return true;
        }
    }
    
    return false;
}

/* -------------------------------------------------------------------------- */
/* Public Event Retrieval                                                     */
/* -------------------------------------------------------------------------- */
bool GCODE_GetNextEvent(GCODE_CommandQueue* cmdQueue, GCODE_Event* event)
{
    if (!cmdQueue || !event) return false;
    if (cmdQueue->count == 0) return false;

    GCODE_Command* gc = &cmdQueue->commands[cmdQueue->tail];
    if (gc->command[0] == '\0') {
        // Empty command - consume it and return false
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        cmdQueue->commands_consumed++;
        return false;
    }

    if (!parse_command_to_event(gc->command, event)) {
        // Parse failed - consume command and return false
        DEBUG_PRINT_GCODE("[GetEvent] Parse failed for: '%s'\r\n", gc->command);
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        cmdQueue->commands_consumed++;
        return false;
    }

    // ✅ SUCCESS: Event parsed, but DON'T consume yet!
    // Event will be consumed after successful processing via GCODE_ConsumeEvent()
    DEBUG_PRINT_GCODE("[GetEvent] Event ready: type=%d from cmd='%s'\r\n", event->type, gc->command);
    return true;
}

/**
 * @brief Consume the current event from the queue after successful processing
 * 
 * CRITICAL: Only call this AFTER successfully processing the event from GCODE_GetNextEvent!
 */
void GCODE_ConsumeEvent(GCODE_CommandQueue* cmdQueue)
{
    if (!cmdQueue) return;
    if (cmdQueue->count == 0) return;
    
    // Remove the event that was just processed
    cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
    cmdQueue->count--;
    cmdQueue->commands_consumed++;
}

