Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/**
 * @brief Check if we should send a deferred "ok" response
 *
 * Two-phase release strategy:
 *
 * Phase A — gcode queue still has commands (q->count > 0):
 *   Release ONE deferred ok each time the gcode queue count DECREASES (a
 *   command was consumed and dispatched to the trajectory planner).
 *   prev_count ensures exactly one ok per consumed slot regardless of how
 *   many times this function is called per iteration.
 *
 * Phase B — gcode queue fully drained (q->count == 0):
 *   Hold ALL remaining deferred oks until physical motion is completely done:
 *     - trajectory queue empty  (motionQueueCount == 0)
 *     - arc generation finished (arcGenState == ARC_GEN_IDLE)
 *   Then flush every remaining pending ok in one burst.
 *
 * This guarantees UGS cannot receive its final ok(s) while stepper motion
 * is still executing, regardless of how many trajectory segments an arc or
 * a dense section of linear moves generates.
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    if (appData == NULL || q == NULL) return;

    // Do NOT release deferred oks while a G4 dwell is in progress.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — suppressing deferred ok release\r\n");
        return;
    }

    // Homing sentinel ($H): hold the $H ok until the homing cycle fully completes.
    // HOMING_IsActive() returns false for IDLE, COMPLETE (transient), and ALARM.
    // Also hold while state == COMPLETE because the fall-through in HOMING_Tasks()
    // resolves COMPLETE→IDLE atomically, but CheckDeferredOk can be called from the
    // motionSegmentCompleted path which runs BEFORE HOMING_Tasks() in app.c.
    // Also hold while INTERPOLATOR is still running — this guards the case where
    // CheckDeferredOk is invoked (through the motionSegmentCompleted path) before
    // HOMING_Tasks() has had a chance to see motionQueueCount == 0 and advance the
    // homing state machine.
    if (s_homing_pending) {
        if (HOMING_IsActive()) { s_homing_started = true; return; }  // mark started, keep holding
        if (!s_homing_started) return;  // $H queued but HOMING_Start() not yet called — hold
        if (HOMING_GetState() == HOMING_STATE_COMPLETE) return;  // transitioning — hold
        if (INTERPOLATOR_IsActive()) return;  // motion still running — hold
        s_homing_pending = false;
        s_homing_started = false;
        if (HOMING_GetState() == HOMING_STATE_ALARM) {
            // Failure: discard the deferred $H ok slot, send the actual alarm code.
            if (okPendingCount > 0) okPendingCount--;
            UART_Printf("ALARM:%u\r\n", (unsigned)HOMING_GetAlarmCode());
            return;
        }
        // Success: fall through to release the one pending ok normally.
        DEBUG_PRINT_GCODE("[FLOW] Homing complete — releasing $H ok\r\n");
    }

    // Program-end sentinel (M2/M30): hold ALL remaining oks until motion fully
    // drains — trajectory empty AND arc generation complete.
    // Only then flush every pending ok in one burst (the M2/M30 ok is the last).
    if (s_program_end_pending) {
        if (appData->motionQueueCount != 0 || appData->arcGenState != ARC_GEN_IDLE) {
            return;  // still moving — wait
        }
        DEBUG_PRINT_GCODE("[DEFERRED] Program end drain — flushing %lu oks\r\n",
                          (unsigned long)okPendingCount);
        while (okPendingCount > 0) {
            if (!UART_SendOK()) break;
            okPendingCount--;
        }
        s_program_end_pending = false;
        return;
    }

    if (okPendingCount == 0) return;

    // Slot-limited release: compute how many G-code commands UGS can safely
    // send without pushing q->count above HIGH_WATER, and release exactly
    // that many deferred oks — no more.
    //
    // Why NOT a while-loop: q->count is a snapshot that does not change
    // during the loop body.  A while loop would release ALL okPendingCount
    // oks when q->count < HIGH_WATER, potentially projecting q->count above
    // GCODE_MAX_COMMANDS (64).  The overflow guard in queue_command() silently
    // drops those extra commands and prints error:20; UGS never gets oks for
    // the dropped commands → deadlock / premature connection close.
    //
    // Slot-limited approach: release at most (HIGH_WATER - q->count) oks per
    // call.  UGS sends exactly that many new commands; q->count reaches
    // HIGH_WATER and stops.  On the next iteration (after a command executes
    // and q->count drops by 1) exactly one more ok is released — steady-state
    // 1-for-1 pipeline without bursts or overflow.
    {
        uint32_t slots = (q->count < (uint32_t)GCODE_QUEUE_HIGH_WATER)
                       ? ((uint32_t)GCODE_QUEUE_HIGH_WATER - q->count)
                       : 0u;
        uint32_t to_release = (okPendingCount < slots) ? okPendingCount : slots;
        for (uint32_t i = 0u; i < to_release; i++) {
            if (!UART_SendOK()) break;
            okPendingCount--;
        }
    }
}

/**
 * @brief Signal that M2/M30 end-of-program was received.
 *
 * Prevents the ok for M2/M30 (and any remaining deferred oks) from being
 * released until all trajectory + arc motion has drained to zero.
 * Called from app.c before GCODE_ConsumeEvent() for PROGRAM_END events.
 */
void GCODE_MarkProgramEnd(void)
{
    s_program_end_pending = true;
    DEBUG_PRINT_GCODE("[FLOW] Program end marked — holding oks until motion drains\r\n");
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 *
 * Gates purely on gcode command queue depth:
 *   >= HIGH_WATER → defer (stop filling UGS send window)
 *   <  HIGH_WATER → send immediately (keep UGS pushing commands)
 *
 * The trajectory planner queue is managed independently (MOTION_Arc backs
 * off at 62/64) — it does NOT gate UGS flow here.
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    // While a G4 dwell is active, always defer.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — deferring ok\r\n");
        okPendingCount++;
        return;
    }

    // Gate purely on gcode queue depth: one ok per one accepted command.
    if (q->count >= GCODE_QUEUE_HIGH_WATER) {
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (gcodeQ=%lu >= HIGH=%d, pending=%lu)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER,
                          (unsigned long)(okPendingCount + 1));
        okPendingCount++;
    } else {
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (gcodeQ=%lu < HIGH=%d)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER);
        (void)UART_SendOK();
    }
}

