Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Main G-code / Protocol Tasks                                               */
/* -------------------------------------------------------------------------- */
void GCODE_Tasks(APP_DATA* appData, GCODE_CommandQueue* commandQueue)
{
    static uint32_t call_counter = 0;
    call_counter++;
    
    // if ((call_counter % 10000) == 0) {
    //     DEBUG_PRINT_GCODE("[GCODE_Tasks] Called %lu times, state=%d\r\n", 
    //                      call_counter, gcodeData.state);
    // }
    
    GCODE_CommandQueue* cmdQueue = commandQueue;
    uint32_t nBytesAvailable = 0;

    // NOTE: GCODE_CheckDeferredOk is called causally in app.c immediately after
    // GCODE_ConsumeEvent(), which is the only safe place to call it.  Calling it
    // here (every main-loop iteration) caused the free-space fallback to fire
    // thousands of times per second, draining okPendingCount far ahead of actual
    // command consumption and causing UGS to consider streaming complete mid-file.

    switch (gcodeData.state)
    {
    case GCODE_STATE_IDLE:
        nBytesAvailable = UART3_ReadCountGet();
        if (nBytesAvailable > 0) {
            uint32_t space = (uint32_t)(sizeof(rxBuffer) - 1U - nBytesRead);
            if (space > 0U) {
                uint32_t toRead = (nBytesAvailable < space) ? nBytesAvailable : space;
                uint32_t got = UART3_Read(&rxBuffer[nBytesRead], toRead);
                nBytesRead += got;
                rxBuffer[nBytesRead] = '\0';
            }
        }

        if (nBytesRead == 0) {
            break;  // No data in buffer, exit IDLE state
        }

        /* Literal "0x18" typed by user */
        if (nBytesRead >= 4 &&
            rxBuffer[0] == '0' && rxBuffer[1] == 'x' &&
            rxBuffer[2] == '1' && rxBuffer[3] == '8') {
            GCODE_SoftReset(appData, cmdQueue);
            break;
        }

        if (is_control_char(rxBuffer[0])) {
            gcodeData.state = GCODE_STATE_CONTROL_CHAR;
        } else {
            bool has_terminator = false;
            uint32_t terminator_pos = 0;
            for (uint32_t i = 0; i < nBytesRead; i++) {
                if (rxBuffer[i] == '\n' || rxBuffer[i] == '\r') {
                    has_terminator = true;
                    terminator_pos = i;
                    break;
                }
            }
            if (!has_terminator) break;
            char saved_terminator = rxBuffer[terminator_pos]; // save for queue-full retry
            rxBuffer[terminator_pos] = '\0';

            // ✅ Check for control chars AFTER termination (handles '?' with newline)
            if (is_control_char(rxBuffer[0])) {
                gcodeData.state = GCODE_STATE_CONTROL_CHAR;
            } else if (rxBuffer[0] == '$') {
                gcodeData.state = GCODE_STATE_QUERY_CHARS;
            } else if (rxBuffer[0] == 'G' || rxBuffer[0] == 'g' ||
                       rxBuffer[0] == 'M' || rxBuffer[0] == 'm' ||
                       rxBuffer[0] == 'F' || rxBuffer[0] == 'f' ||
                       rxBuffer[0] == 'T' || rxBuffer[0] == 't' ||
                       rxBuffer[0] == 'S' || rxBuffer[0] == 's') {
                gcodeData.state = GCODE_STATE_GCODE_COMMAND;
            } else {
                // Determine if line contains G-code content (ignore pure comments / whitespace)
                bool has_content = false;
                // Find first non-whitespace character
                uint32_t first_idx = 0;
                while (first_idx < terminator_pos) {
                    char c = rxBuffer[first_idx];
                    if (c == ' ' || c == '\t') { first_idx++; continue; }
                    break;
                }
                if (first_idx < terminator_pos) {
                    char first = rxBuffer[first_idx];
                    if (first == ';' || first == '(') {
                        // Comment-only line → treat as blank, do not queue
                        has_content = false;
                    } else {
                        // Any other non-whitespace, non-comment first char counts as content
                        has_content = true;
                    }
                }
                if (has_content) {
                    DEBUG_PRINT_GCODE("[IDLE] Processing line: '%s'\r\n", rxBuffer);
                    uint32_t count_before_idle = cmdQueue->count;
                    cmdQueue = Extract_CommandLineFrom_Buffer(rxBuffer, terminator_pos, cmdQueue);
                    if (cmdQueue->count == count_before_idle) {
                        // Queue full — restore the line terminator so IDLE re-finds
                        // it on the next iteration and retries without losing the line.
                        rxBuffer[terminator_pos] = saved_terminator;
                        DEBUG_PRINT_GCODE("[IDLE] Queue full — retrying next iteration\r\n");
                        break;
                    }
                    // ✅ Send "ok" for all lines with content
                    DEBUG_PRINT_GCODE("[IDLE] Sending ok for content line\r\n");
                    SendOrDeferOk(appData, cmdQueue);
                } else {
                    // ✅ GRBL v1.1 behavior: Blank/comment lines get "ok" response.
                    // CRITICAL: blank/comment lines do NOT occupy a gcode queue slot
                    // (Extract_CommandLineFrom_Buffer is not called, q->count unchanged).
                    // Therefore we must NEVER defer their ok via SendOrDeferOk — doing
                    // so inflates okPendingCount independently of q->count.  When those
                    // phantom oks later burst-release they invite UGS to send commands
                    // that push q->count past GCODE_MAX_COMMANDS, silently dropping them.
                    // Pure arc tests hide this because they have almost no blank lines;
                    // mixed-content files (sections separated by comment blocks) expose it.
                    // Solution: always send ok immediately for blank/comment lines.
                    DEBUG_PRINT_GCODE("[IDLE] Blank/comment line - sending ok immediately (no queue slot)\r\n");
                    (void)UART_SendOK();
                }
                uint32_t skip_pos = terminator_pos + 1;
                while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n'))
                    skip_pos++;
                uint32_t remaining_bytes = nBytesRead - skip_pos;
                if (remaining_bytes > 0) {
                    memmove(rxBuffer, &rxBuffer[skip_pos], remaining_bytes);
                    nBytesRead = remaining_bytes;
                    rxBuffer[nBytesRead] = '\0';
                } else {
                    nBytesRead = 0;
                    memset(rxBuffer, 0, sizeof(rxBuffer));
                }
                break;
            }
        }
        /* fall-through */

    case GCODE_STATE_CONTROL_CHAR:
    {
        if (gcodeData.state != GCODE_STATE_CONTROL_CHAR) break;

        uint8_t c = rxBuffer[0];
        switch (c) {
            case '?': {
                StepperPosition* pos = STEPPER_GetPosition();
                WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();

                // Array-based position calculation with loop for scalability
                float mpos[NUM_AXIS];
                float wpos[NUM_AXIS];
                
                for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                    mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
                    wpos[axis] = mpos[axis] - GET_COORDINATE_AXIS(&wcs->offset, axis);
                }

                const char* state = "Idle";
                if (grblAlarm) {
                    state = "Alarm";
                } else if (g_feed_hold_pending) {
                    state = "Hold:1";  // GRBL v1.1: Hold:1 = draining / decelerating
                } else if (g_feed_hold_active) {
                    state = "Hold:0";  // GRBL v1.1: Hold:0 = fully stopped
                } else if (MOTION_IsJogging()) {
                    state = "Jog";
                } else if (appData->arcGenState == ARC_GEN_ACTIVE) {
                    // Arc generator active → still processing arc segments
                    state = "Run";
                } else if ((T4CON & _T4CON_ON_MASK) != 0) {
                    // Hardware timer running → motion in progress (or about to start)
                    state = "Run";
                } else if (appData->motionQueueCount > 0) {
                    // Motion queue has segments waiting
                    state = "Run";
                }

                // FS feedrate: read actual step_interval from the executing ISR segment.
                // prep_current_speed tracks the look-ahead preparation cursor, NOT
                // the segment currently clocking through the ISR, so it lags/leads
                // the real executing speed.  STEPPER_GetCurrentFeedrateMmMin() reads
                // the hardware timer ticks directly – zero ambiguity.
                float feedrate_mm_min = 0.0f;
                if (state[0] == 'R' || state[0] == 'J') {
                    feedrate_mm_min = STEPPER_GetCurrentFeedrateMmMin();
                    if (feedrate_mm_min < 1.0f) {
                        // Fallback: use modal feedrate if step_interval not yet loaded
                        feedrate_mm_min = (appData->modalFeedrate > 0.0f) ? appData->modalFeedrate : 0.0f;
                    }
                }
                // ✅ FIX: XC32 -msingle-float ABI mismatch — printf lib expects 8-byte double
                // for %f/%g but caller passes 4-byte float.  Convert both to uint32_t and
                // use %lu so there is zero float/double argument-size ambiguity.
                uint32_t feed_display   = (uint32_t)(feedrate_mm_min + 0.5f);
                uint32_t spindle_display = appData->modalSpindleRPM;

                uint32_t response_len = (uint32_t)snprintf((char*)txBuffer, sizeof(txBuffer),
                    "<%s|MPos:%.3f,%.3f,%.3f|WPos:%.3f,%.3f,%.3f|FS:%lu,%lu%s%s>\r\n",
                    state, 
                    mpos[AXIS_X], mpos[AXIS_Y], mpos[AXIS_Z], 
                    wpos[AXIS_X], wpos[AXIS_Y], wpos[AXIS_Z],
                    (unsigned long)feed_display, (unsigned long)spindle_display,
                    grblCheckMode ? "|Cm:1" : "",
                    "");  // Hold state reported via state string (Hold:0), not separate flag
                UART3_Write(txBuffer, response_len);
                
                // ⚠️ Real-time commands NEVER trigger deferred ok checks
                // The deferred ok will be sent by IDLE loop (line 668) or next command
                break;
            }
            case '~': /* Cycle start / resume */
                if (g_feed_hold_active || g_feed_hold_pending) {
                    STEPPER_ResumeMotion();  // Cancels pending OR restarts from full stop
                    DEBUG_PRINT_GCODE("[GCODE] Feed hold released — motion resuming\r\n");
                }
                break;
            case '!': /* Feed hold */
                if (!g_feed_hold_active && !g_feed_hold_pending) {
                    STEPPER_PauseMotion();   // Sets pending (drain) or immediate if queue empty
                    DEBUG_PRINT_GCODE("[GCODE] Feed hold active\r\n");
                }
                break;
            case 0x18: /* Soft reset (Ctrl+X) */
            {
                GCODE_SoftReset(appData, cmdQueue);
                break;
            }
            case 0x85: /* Jog cancel — flush queued jog moves, no alarm */
                MOTION_JogCancel();
                // No response per GRBL v1.1 spec
                break;
            case 0x95: /* XOFF - flow control, ignore */
            case 0x90: /* DLE - data link escape, ignore */
            case 0x99: /* Unknown control char - ignore */
            case 0x11: /* XON - flow control, ignore */
            case 0x13: /* DC3/XOFF - flow control, ignore */
                // Flow control characters - silently consume without "ok" response
                // These are not G-code commands and don't require acknowledgment
                DEBUG_PRINT_GCODE("[GCODE] Ignoring flow control byte: 0x%02X\r\n", rxBuffer[0]);
                break;
            default:
                // Unknown control character - ignore
                DEBUG_PRINT_GCODE("[GCODE] Unknown control char: 0x%02X\r\n", rxBuffer[0]);
                break;
        }

        // ✅ GRBL PROTOCOL: Real-time commands (? ! ~) NEVER generate "ok" responses
        // ✅ Flow control characters (0x95, 0x90, etc.) also don't generate "ok"
        // Consume control character at position 0, plus any trailing CR/LF
        // This prevents "?\r\n" from leaving "\r\n" which would be processed as blank line
        uint32_t skip_pos = 1;  // Skip the control character itself
        while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n')) {
            skip_pos++;  // Skip all trailing line terminators
        }
        
        if (skip_pos < nBytesRead) {
            // Remaining bytes after control char + terminators
            memmove(rxBuffer, &rxBuffer[skip_pos], nBytesRead - skip_pos);
            nBytesRead -= skip_pos;
            rxBuffer[nBytesRead] = '\0';
            if (nBytesRead > 0 && is_control_char(rxBuffer[0])) {
                gcodeData.state = GCODE_STATE_CONTROL_CHAR;
            } else {
                gcodeData.state = GCODE_STATE_IDLE;
            }
        } else {
            // Nothing left after consuming control char and terminators - clear everything
            nBytesRead = 0;
            rxBuffer[0] = '\0';  // ✅ Ensure first byte is null
            memset(rxBuffer, 0, sizeof(rxBuffer));
            gcodeData.state = GCODE_STATE_IDLE;
        }
        break;
    }

    case GCODE_STATE_QUERY_CHARS:
    {
        const char* cmd = (const char*)rxBuffer;
        size_t len = strlen(cmd);

        bool send_ok = true;
        bool handled = false;

        if (len >= 4 && cmd[0] == '$' && cmd[1] == 'N' && isdigit((unsigned char)cmd[2]) && cmd[3] == '=') {
            int idx = cmd[2] - '0';
            if (idx == 0 || idx == 1) {
                const char* line = &cmd[4];
                size_t l = strlen(line);
                if (l >= GCODE_BUFFER_SIZE) l = GCODE_BUFFER_SIZE - 1;
                size_t w = 0;
                for (size_t i = 0; i < l && w < (GCODE_BUFFER_SIZE - 1); i++) {
                    unsigned char ch = (unsigned char)line[i];
                    if (ch == '\r' || ch == '\n') break;
                    if (ch >= 32 && ch <= 126) startupLines[idx][w++] = (char)ch;
                }
                startupLines[idx][w] = '\0';
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == '$') {
            SETTINGS_PrintAll(SETTINGS_GetCurrent());
            handled = true;
            send_ok = false;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == '#') {
            // GRBL $# command: Report work coordinate systems and offsets
            char buf[400];  // Increased buffer for all WCS data
            int p = 0;
            
            // Report all work coordinate systems (G54-G59)
            for (uint8_t wcs = 0; wcs < 6; wcs++) {
                float x, y, z;
                if (SETTINGS_GetWorkCoordinateSystem(wcs, &x, &y, &z)) {
                    p += snprintf(&buf[p], sizeof(buf)-p, "[G%d:%.3f,%.3f,%.3f]\r\n", 
                                 54 + wcs, x, y, z);
                }
            }
            
            // Report G92 coordinate offset (live value from kinematics, not flash)
            float g92_x, g92_y, g92_z;
            KINEMATICS_GetG92Offset(&g92_x, &g92_y, &g92_z);
            p += snprintf(&buf[p], sizeof(buf)-p, "[G92:%.3f,%.3f,%.3f]\r\n", g92_x, g92_y, g92_z);
            
            // Report live tool length offset (reflects G43, G43.1 and G49)
            bool tlo_active = false;
            float tlo = KINEMATICS_GetTLO(&tlo_active);
            (void)tlo_active;  // active flag available for future use
            p += snprintf(&buf[p], sizeof(buf)-p, "[TLO:%.3f]\r\n", tlo);
            
